# RebarIncludeLastBar Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RebarIncludeLastBar Property
ParameterTypeId Class See Also
---
"Include Last Bar"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RebarIncludeLastBar { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RebarIncludeLastBar As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RebarIncludeLastBar {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace